{
  "order":[
    "radio", "adventure", "liquid", "trace", "harley", "meundies", "aside", "krapi", "boz", "wd40", "barry", "makeful", "tide", "schedulizer", "kaleb", "mlb", "media"
  ],
  "adventure":{
    "key":"adventure",
    "title":"Adventure Time Krukar",
    "category":"Art",
    "description":[
      "Adventure Time is one of my favorite cartoons. One day I found a series of Adventure Time comics that had really nice profile drawings of the main cast. So I drew myself in that style. I ended up printing this out at 24x36 inches and hanging it on my wall. Every year on my birthday I have my friends sign the background."
    ],
    "link": "http://sperg.life/michaelkrukar/adventure.png",
    "image":"adventure.png"
  },
  "aside":{
    "key":"aside",
    "title":"Aside",
    "category":"Web",
    "description":["On The A Side is Blue Ant Media’s music channel rebrand. Formerly AUX, it’s been rebranded in to a Canadian Pitchfork.", "As Lead Front End dev I architected the original build using Webpack and a custom flexbox implementation. Since there was very little Javascript I decided not to use a framework and built a lightweight, Class based, modular codebase." ,"I stopped working on it right before launch so any half baked features poorly implemented post launch are not my fault."    ],
    "link":"http://ontheaside.com/",
    "image":"aside.jpg"
  },
  "barry":{
    "key":"barry",
    "title":"Barry",
    "category":"Photography",
    "description":[
      "To commemorate my cosplay I took this photo. I've always wanted to dress up for Fan Expo and in 2015 I did, I went as Barry Dylan from Archer. The costume is just a classic red track suit, dyed blonde hair and a tiny amount of makeup to look more cartoony. A few people recognized me, some thought I was the Six Million Dollar man. Photo inspired by George Costanza."
    ],
    "link": "http://sperg.life/michaelkrukar/barry.jpg",
    "image":"barry.jpg"
  },
  "boz":{
    "key":"boz",
    "title":"Design Portfolio",
    "category":"Web",
    "description":[
      "Through a friend I got in contact with a designer that needed a portfolio. Done in Wordpress, I modified a theme to suit their needs then added all the content."
    ],
    "link":"http://mikeboz.com/",
    "image":"boz.png"
  },
  "harley":{
    "key":"harley",
    "title":"Harley Lichtenstein",
    "category":"Art",
    "description":[
      "I could never draw, but I could always steal. If you steal enough things, throw them together and do some actual work then it's your own. They won't question that you stole it. As long as you do some actual work, that's the key.", "Roy Fox Lichtenstein was an American pop artist. During the 1960s, along with Andy Warhol, Jasper Johns, and James Rosenquist among others, he became a leading figure in the new art movement.", "Harley Quinn (Harleen Frances Quinzel) is a fictional character appearing in American comic books published by DC Comics, commonly as an adversary of the superhero Batman and commonly as the Joker's sidekick."
    ],
    "link": "http://sperg.life/michaelkrukar/harley.png",
    "image":"harley.png"
  },
  "kaleb":{
    "key":"kaleb",
    "title":"Kaleb",
    "category":"Art",
    "description":[
      "For my friend's wedding I wanted to get him a unique gift. I also wanted to pad my portfolio. We're both big fans of Archer so I decided to draw his newborn son Archer style."
    ],
    "link": "http://sperg.life/michaelkrukar/kaleb.png",
    "image":"kaleb.png"
  },
  "krapi":{
    "key":"krapi",
    "title":"Krukar API",
    "category":"Web",
    "description":[
      "Personal API"
    ],
    "link": "http://krapi.michaelkrukar.com/",
    "image":"krapi.png"
  },
  "liquid":{
    "key":"liquid",
    "title":"Liquid Rising",
    "category":"Video",
    "description":[
      "Liquid Rising is a documentary I released in 2012. I worked with Team Liquid to follow their Starcraft 2 team to various events. I ended up going to IPL 4 in Atlantic City, Team Liquid HQ in New York, MLG Orlando, Blizzcon in Anaheim, GSL in Seoul, South Korea and Las Vegas. The documentary was released with a pay what you want model and earned a profit. Anyone that paid past a certain amount earned a free poster. Al], footage was shot by me on a Canon DSLR and edited in Adobe Premiere Pro. Audio was edited by me in Pro Tools. The animations were drawn by a TL fan and out sourced to an After Effects editor."
    ],
    "link":"https://www.youtube.com/watch?v=_R2Ep6L5gIA",
    "image":"liquid.jpg"
  },
  "makeful":{
    "key":"makeful",
    "title":"Makeful",
    "category":"Web",
    "description":[
      "Makeful is a DIY community website launched by Blue Ant Media. This is the second verison of Makeful that I worked on. The original build was done using Wordpress, Angular and Foundation. The current version uses Laravel to handle the backend while the JS was done entirely with jQuery. A third iteration is likely."
    ],
    "link":"http://bemakeful.com/",
    "image":"makeful.jpg"
  },
  "media":{
    "key":"media",
    "title":"Media Visualizer",
    "category":"Web",
    "description":[
      "I'm fascinated with visualizing data. I've been collecting data on all the media I consume since 2013. This includes when I finished reading a book, when I watched a movie and when I completed a video game. By visualizing data you begin to see new patterns. What does this visualization reveal about me."
    ],
    "link":"http://media.michaelkrukar.com/",
    "image":"media.png"
  },
  "meundies":{
    "key":"meundies",
    "title":"Meundies",
    "category":"Photography",
    "description":[
      "Underwear hanging on a clothes line, so quaint. Every month <a href='https://www.meundies.com/' target='_blank'>Meundies</a> releases a pair of underwear with a brand new design. I hung them up in chronological order and had a fun photoshoot. Meundies reached out to me, asking if they can use it in their advertising. Now I can claim I'm a professional commercial photographer."
    ],
    "link": "https://www.flickr.com/photos/michaelkrukar/28332931732/",
    "image":"meundies.jpg"
  },
  "mlb":{
    "key":"mlb",
    "title":"MLB Stats",
    "category":"Web",
    "description":[
      "As part of an interview process I was asked to build a MLB scoreboard. I didn't get the job but I learned a few things about React and liked the completed project so I cleaned it up a little more and added it to my portfolio."
    ],
    "link":"http://mlb.michaelkrukar.com",
    "image":"mlb.png"
  },
  "radio":{
    "key":"radio",
    "title":"Krukar Radio",
    "category":"Web",
    "description":[
      "I listen to a lot of music. Occasionally I'll hear a song on the radio and write down what it's called, then at work I'll open up YouTube and listen to them. Tragically after every song I have to go back to YouTube and find the next song. So I decided to build something to automate this inconvenience.",
      "I also use this on my phone so I made it as lean as possible, it's all one page minified. To push it even further it's written entirely in vanilla JS.",
      "This is version 2], There was a version 1 which was an ambitious web app but it never took off. It was originally called Krukar's Playlist but I pivoted to Krukar Radio."
    ],
    "link":"http://radio.michaelkrukar.com",
    "image":"radio.jpg"
  },
  "schedulizer":{
    "key":"schedulizer",
    "title":"BAM Schedulizer",
    "category":"Web",
    "description":[
      "At Blue Ant Media we work with tv schedules, which are generated in a very convoluted and error prone way. To ease this process I built an internal tool to automate the entire process. An editor uploads a raw file that is exported out of Broadview. This file then gets processed in NodeJS, generated JSON goes to Amazon S3 and generated XML files go to specific servers.", " It's only accessible by employees at work, but the code and ideas behind it are worth mentioning here."
    ],
    "image":"schedulizer.jpg"
  },
  "tide":{
    "key":"tide",
    "title":"Turn of the Tide",
    "category":"Video",
    "description":[
      "Video experience of a classic Dota 2 moment, Navi vs IG at The International 2. Recorded at 1,000 FPS in game. Song used in the video is M83 - Lower Your Eyelids To Die With The Sun."
    ],
    "link":"https://www.youtube.com/watch?v=mahHF8dIeVg",
    "image":"tide.jpg"
  },
  "trace":{
    "key":"trace",
    "title":"TRaCE",
    "category":"Web",
    "description":[
      "Wordpress site built for McGill University. I was contracted by <a href='http://www.goodlookinkids.com/' target='_blank'>Good Looking Kids</a> to handle development and deployment. TRaCE is a one-year pilot project which aims to track what PhDs are doing, report that descriptionrmation to universities and the public, connect PhDs inside and outside the university and foster exchanges of knowledge among one another."
    ],
    "link":"http://iplaitrace.com/",
    "image":"trace.png"
  },
  "wd40":{
    "key":"wd40",
    "title":"WD40 TV Spot",
    "category":"Video",
    "description":[
      "Through some connections at Corus I was hired to direct a 30 second TV spot for WD40. The entire project went from brainstorming to completion in 2 weeks. I worked with a designer on the graphical elements and we hired a radio announcer to do the read. Aired on Discovery Channel Canada in May 2013."
    ],
    "link":"https://www.youtube.com/watch?v=r6VDYO5MSDQ",
    "image":"wd40.jpg"
  }
}
